In [1]:
# Import Statements
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

In [2]:
# Setting Up
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

atlas_cluster_name = "sandbox.zibbf"
atlas_user_name = "gmf7dpk"
atlas_password = "TheUserForGrant"

conn_str2 = f"mongodb+srv://{atlas_user_name}:{atlas_password}@sandbox.qsabeum.mongodb.net/?retryWrites=true&w=majority"

src_dbname = "sakila"
src_dbname2 = "Sakila"
dst_dbname = "sakila_dw2"

In [3]:
# Functions for Retrieving and Setting Data Frames
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()
    
def get_mongo_dataframe(connect_str, db_name, collection, query):
    client = pymongo.MongoClient(connect_str)
    
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe

In [4]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [90]:
# Retrieving Data from NoSQL Database (first source)
# The sakila SQL database used (third source) describes a number of films (which will be loaded into the Data Warehouse).
# This data includes new films not already listed in the sakila database, and can be transformed merged with the original data if desired!
query = {}
collection = "New_Films"

df_new_films = get_mongo_dataframe(conn_str2, src_dbname2, collection, query)
drop_col = ['Poster', 'Images']
df_candidates.insert(0, "new_films_key", range(1, 51))
df_new_films.head(10)

,Title,Year,Rated,Released,Runtime,Genre,Director,Writer,Actors,Plot,...,Poster,Metascore,imdbRating,imdbVotes,imdbID,Type,Response,Images,totalSeasons,ComingSoon
0,Avatar,2009,PG-13,18 Dec 2009,162 min,"Action, Adventure, Fantasy",James Cameron,James Cameron,"Sam Worthington, Zoe Saldana, Sigourney Weaver...",A paraplegic marine dispatched to the moon Pan...,...,http://ia.media-imdb.com/images/M/MV5BMTYwOTEw...,83,7.9,"890,617",tt0499549,movie,True,[https://images-na.ssl-images-amazon.com/image...,NaN,NaN
1,I Am Legend,2007,PG-13,14 Dec 2007,101 min,"Drama, Horror, Sci-Fi",Francis Lawrence,"Mark Protosevich (screenplay), Akiva Goldsman ...","Will Smith, Alice Braga, Charlie Tahan, Salli ...",Years after a plague kills most of humanity an...,...,http://ia.media-imdb.com/images/M/MV5BMTU4NzMy...,65,7.2,"533,874",tt0480249,movie,True,[https://images-na.ssl-images-amazon.com/image...,NaN,NaN
2,The Avengers,2012,PG-13,04 May 2012,143 min,"Action, Sci-Fi, Thriller",Joss Whedon,"Joss Whedon (screenplay), Zak Penn (story), Jo...","Robert Downey Jr., Chris Evans, Mark Ruffalo, ...",Earth's mightiest heroes must come together an...,...,http://ia.media-imdb.com/images/M/MV5BMTk2NTI1...,69,8.1,"1,003,301",tt0848228,movie,True,[https://images-na.ssl-images-amazon.com/image...,NaN,NaN
3,The Wolf of Wall Street,2013,R,25 Dec 2013,180 min,"Biography, Comedy, Crime",Martin Scorsese,"Terence Winter (screenplay), Jordan Belfort (b...","Leonardo DiCaprio, Jonah Hill, Margot Robbie, ...","Based on the true story of Jordan Belfort, fro...",...,http://ia.media-imdb.com/images/M/MV5BMjIxMjgx...,75,8.2,"786,985",tt0993846,movie,True,[https://images-na.ssl-images-amazon.com/image...,NaN,NaN
4,Interstellar,2014,PG-13,07 Nov 2014,169 min,"Adventure, Drama, Sci-Fi",Christopher Nolan,"Jonathan Nolan, Christopher Nolan","Ellen Burstyn, Matthew McConaughey, Mackenzie ...",A team of explorers travel through a wormhole ...,...,http://ia.media-imdb.com/images/M/MV5BMjIxNTU4...,74,8.6,"937,412",tt0816692,movie,True,[https://images-na.ssl-images-amazon.com/image...,NaN,NaN
5,Game of Thrones,2011–,TV-MA,17 Apr 2011,56 min,"Adventure, Drama, Fantasy",N/A,"David Benioff, D.B. Weiss","Peter Dinklage, Lena Headey, Emilia Clarke, Ki...",While a civil war brews between several noble ...,...,http://ia.media-imdb.com/images/M/MV5BMjM5OTQ1...,N/A,9.5,"1,046,830",tt0944947,series,True,[https://images-na.ssl-images-amazon.com/image...,7,NaN
6,Vikings,2013–,TV-14,03 Mar 2013,44 min,"Action, Drama, History",N/A,Michael Hirst,"Travis Fimmel, Clive Standen, Gustaf Skarsgård...",The world of the Vikings is brought to life th...,...,http://ia.media-imdb.com/images/M/MV5BOTEzNzI3...,N/A,8.6,"198,041",tt2306299,series,True,[https://images-na.ssl-images-amazon.com/image...,5,NaN
7,Gotham,2014–,TV-14,01 Aug 2014,42 min,"Action, Crime, Drama",N/A,Bruno Heller,"Ben McKenzie, Donal Logue, David Mazouz, Sean ...",The story behind Detective James Gordon's rise...,...,http://ia.media-imdb.com/images/M/MV5BMTY2MjMw...,N/A,8.0,"133,375",tt3749900,series,True,[https://images-na.ssl-images-amazon.com/image...,3,NaN
8,Power,2014–,TV-MA,N/A,50 min,"Crime, Drama",N/A,Courtney Kemp Agboh,"Omari Hardwick, Joseph Sikora, Andy Bean, Lela...","James ""Ghost"" St. Patrick, a wealthy New York ...",...,http://ia.media-imdb.com/images/M/MV5BOTA4NTkz...,N/A,8.0,"14,770",tt3281796,series,True,[https://images-na.ssl-images-amazon.com/image...,3,NaN
9,Narcos,2015–,TV-MA,28 Aug 2015,49 min,"Biography, Crime, Drama",N/A,"Carlo Bernard, Chris Brancato, Doug Miro, Paul...","Wagner Moura, Boyd Holbrook, Pedro Pascal, Joa...",A chronicled look at the criminal exploits of ...,...,http://ia.media-imdb.com/images/M/MV5BMTU0ODQ4...,N/A,8.9,"118,680",tt2707408,series,True,[https://images-na.ssl-images-amazon.com/image...,2,NaN

In [102]:
# Inserting table into database 
set_dataframe(user_id, pwd, host_name, dst_dbname, df_candidates, 'dim_new_films', 'new_films_key', "insert")

In [85]:
# Retrieving Data from Local File System (second source)
# This data describes candidates, as well as their personal address and current company, who have applied to work at sakila.
# If eventually hired, the candidates' information would be move to the staff table!
data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, '50-contacts.csv')

df_candidates = pd.read_csv(data_file, header=0, index_col=0)
df_candidates.insert(0, "candidates_key", range(1, df_candidates.shape[0]+1))
df_candidates.head(10)

,candidates_key,last_name,company_name,address,city,county,state,zip,phone1,phone,email
first_name,,,,,,,,,,,
James,1,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com
Josephine,2,Darakjy,"Chanay, Jeffrey A Esq",4 B Blue Ridge Blvd,Brighton,Livingston,MI,48116,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org
Art,3,Venere,"Chemel, James L Cpa",8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,8014,856-636-8749,856-264-4130,art@venere.org
Lenna,4,Paprocki,Feltz Printing Service,639 Main St,Anchorage,Anchorage,AK,99501,907-385-4412,907-921-2010,lpaprocki@hotmail.com
Donette,5,Foller,Printing Dimensions,34 Center St,Hamilton,Butler,OH,45011,513-570-1893,513-549-4561,donette.foller@cox.net
Simona,6,Morasca,"Chapman, Ross E Esq",3 Mcauley Dr,Ashland,Ashland,OH,44805,419-503-2484,419-800-6759,simona@morasca.com
Mitsue,7,Tollner,Morlong Associates,7 Eads St,Chicago,Cook,IL,60632,773-573-6914,773-924-8565,mitsue_tollner@yahoo.com
Leota,8,Dilliard,Commercial Press,7 W Jackson Blvd,San Jose,Santa Clara,CA,95111,408-752-3500,408-813-1105,leota@hotmail.com
Sage,9,Wieser,Truhlar And Truhlar Attys,5 Boston Ave #88,Sioux Falls,Minnehaha,SD,57105,605-414-2147,605-794-4895,sage_wieser@cox.net
Kris,10,Marrier,"King, Christopher A Esq",228 Runamuck Pl #2808,Baltimore,Baltimore City,MD,21224,410-655-8723,410-804-4694,kris@gmail.com

In [101]:
# Inserting table into database
set_dataframe(user_id, pwd, host_name, dst_dbname, df_candidates, 'dim_candidates', 'candidates_key', "insert")

In [6]:
# Data from SQL Database (third source)
sql_customer = "SELECT * FROM sakila.customer;"
df_customer = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customer)
df_customer.head(10)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20
5,6,2,JENNIFER,DAVIS,JENNIFER.DAVIS@sakilacustomer.org,10,1,2006-02-14 22:04:36,2006-02-15 04:57:20
6,7,1,MARIA,MILLER,MARIA.MILLER@sakilacustomer.org,11,1,2006-02-14 22:04:36,2006-02-15 04:57:20
7,8,2,SUSAN,WILSON,SUSAN.WILSON@sakilacustomer.org,12,1,2006-02-14 22:04:36,2006-02-15 04:57:20
8,9,2,MARGARET,MOORE,MARGARET.MOORE@sakilacustomer.org,13,1,2006-02-14 22:04:36,2006-02-15 04:57:20
9,10,1,DOROTHY,TAYLOR,DOROTHY.TAYLOR@sakilacustomer.org,14,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [7]:
sql_staff = "SELECT * FROM sakila.staff;"
df_staff = get_dataframe(user_id, pwd, host_name, src_dbname, sql_staff)
df_staff.head(10)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [8]:
sql_film = "SELECT * FROM sakila.film;"
df_film = get_dataframe(user_id, pwd, host_name, src_dbname, sql_film)
df_film.head(10)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
5,6,AGENT TRUMAN,A Intrepid Panorama of a Robot And a Boy who m...,2006,1,None,3,2.99,169,17.99,PG,Deleted Scenes,2006-02-15 05:03:42
6,7,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,1,None,6,4.99,62,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42
7,8,AIRPORT POLLOCK,A Epic Tale of a Moose And a Girl who must Con...,2006,1,None,6,4.99,54,15.99,R,Trailers,2006-02-15 05:03:42
8,9,ALABAMA DEVIL,A Thoughtful Panorama of a Database Administra...,2006,1,None,3,2.99,114,21.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42
9,10,ALADDIN CALENDAR,A Action-Packed Tale of a Man And a Lumberjack...,2006,1,None,6,4.99,63,24.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [9]:
# Data Transformation
# Removed picture column
drop_col = ['picture']
df_staff.drop(drop_col, axis=1, inplace=True)
df_staff.head(2)

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [10]:
# Insert tables into the SQL database
db_operation = "insert"

tables = [('dim_customer', df_customer, 'customer_id'),
          ('dim_staff', df_staff, 'staff_id'),
          ('dim_film', df_film, 'film_id')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [12]:
# Data from SQL Database (third source)
# With the data already loaded into MySQL Workbench, the following tables (inventory, film (already displayed above), and store) will be the dimension tables which correspond to our eventual fact table.
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory)
df_inventory.head(10)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17
2             3        1         1 2006-02-15 05:09:17
3             4        1         1 2006-02-15 05:09:17
4             5        1         2 2006-02-15 05:09:17
5             6        1         2 2006-02-15 05:09:17
6             7        1         2 2006-02-15 05:09:17
7             8        1         2 2006-02-15 05:09:17
8             9        2         2 2006-02-15 05:09:17
9            10        2         2 2006-02-15 05:09:17

In [13]:
sql_store = "SELECT * FROM sakila.store;"
df_store = get_dataframe(user_id, pwd, host_name, src_dbname, sql_store)
df_store.head(10)

   store_id  manager_staff_id  address_id         last_update
0         1                 1           1 2006-02-15 04:57:12
1         2                 2           2 2006-02-15 04:57:12

In [49]:
# Merging dimension tables to create fact table
df_fact_inventory = pd.merge(df_inventory, df_film, on='film_id', how='left')
df_fact_inventory = pd.merge(df_fact_inventory, df_store, on='store_id', how='left')
drop_cols = ['last_update_x', 'last_update_y', 'description', 'language_id', 'original_language_id', 'manager_staff_id', 'address_id']
df_fact_inventory.drop(drop_cols, axis=1, inplace=True)
df_fact_inventory.rename(columns={"inventory_id":"fact_inventory_id"}, inplace=True)
df_fact_inventory['last_update'] = df_fact_inventory['last_update'].dt.date
df_fact_inventory.sort_values(by=['fact_inventory_id'])
df_fact_inventory.head(20)

,fact_inventory_id,film_id,store_id,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
1,2,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
2,3,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
3,4,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
4,5,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
5,6,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
6,7,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
7,8,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15
8,9,2,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15
9,10,2,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15
10,11,2,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15
11,12,3,2,ADAPTATION HOLES,2006,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15
12,13,3,2,ADAPTATION HOLES,2006,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15
13,14,3,2,ADAPTATION HOLES,2006,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15
14,15,3,2,ADAPTATION HOLES,2006,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15
15,16,4,1,AFFAIR PREJUDICE,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15
16,17,4,1,AFFAIR PREJUDICE,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15
17,18,4,1,AFFAIR PREJUDICE,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15
18,19,4,1,AFFAIR PREJUDICE,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15
19,20,4,2,AFFAIR PREJUDICE,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15

In [50]:
# Inserting the fact table into the database
set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_inventory, "fact_inventory", "fact_inventory_id", db_operation)

In [38]:
# Date Dimension Table (created in MySQL Workbench)
sql_dim_date = "SELECT * FROM sakila_dw2.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_dim_date)
df_dim_date.tail(10)

,date_key,full_date,date_name,date_name_us,date_name_eu,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,...,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
1451,20081222,2008-12-22,2008/12/22,12/22/2008,22/12/2008,2,Monday,22,357,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1452,20081223,2008-12-23,2008/12/23,12/23/2008,23/12/2008,3,Tuesday,23,358,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1453,20081224,2008-12-24,2008/12/24,12/24/2008,24/12/2008,4,Wednesday,24,359,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1454,20081225,2008-12-25,2008/12/25,12/25/2008,25/12/2008,5,Thursday,25,360,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1455,20081226,2008-12-26,2008/12/26,12/26/2008,26/12/2008,6,Friday,26,361,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1456,20081227,2008-12-27,2008/12/27,12/27/2008,27/12/2008,7,Saturday,27,362,Weekend,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1457,20081228,2008-12-28,2008/12/28,12/28/2008,28/12/2008,1,Sunday,28,363,Weekend,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1458,20081229,2008-12-29,2008/12/29,12/29/2008,29/12/2008,2,Monday,29,364,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1459,20081230,2008-12-30,2008/12/30,12/30/2008,30/12/2008,3,Tuesday,30,365,Weekday,...,N,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2
1460,20081231,2008-12-31,2008/12/31,12/31/2008,31/12/2008,4,Wednesday,31,366,Weekday,...,Y,4,2008,2008-12,2008Q4,6,2,2009,2009-06,2009Q2

In [51]:
# New Fact Inventory table with updated inventory_date_key
sql_fact_inventory = "SELECT * FROM sakila_dw2.fact_inventory;"
df_fact_inventory = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_fact_inventory)
df_fact_inventory.head(10)

,fact_inventory_id,film_id,store_id,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,inventory_date_key
0,1,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
1,2,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
2,3,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
3,4,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
4,5,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
5,6,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
6,7,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
7,8,1,2,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
8,9,2,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",20060215
9,10,2,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",20060215

In [92]:
# SELECT statements
# The number of each film in stock
sql_fact_inventory = "SELECT title, COUNT(*) FROM sakila_dw2.fact_inventory GROUP BY title"
df_fact_inventory = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_fact_inventory)
df_fact_inventory.head(10)

              title  COUNT(*)
0  ACADEMY DINOSAUR         8
1    ACE GOLDFINGER         3
2  ADAPTATION HOLES         4
3  AFFAIR PREJUDICE         7
4       AFRICAN EGG         3
5      AGENT TRUMAN         6
6   AIRPLANE SIERRA         5
7   AIRPORT POLLOCK         4
8     ALABAMA DEVIL         5
9  ALADDIN CALENDAR         7

In [99]:
# The average rental rate by rental duration (in hours)
sql_film = "SELECT rental_duration, AVG(rental_rate) FROM sakila_dw2.dim_film GROUP BY rental_duration ORDER BY rental_duration;"
df_film = get_dataframe(user_id, pwd, host_name, src_dbname, sql_film)
df_film.head(10)

   rental_duration  AVG(rental_rate)
0                3          2.832365
1                4          2.970296
2                5          3.199424
3                6          2.895660
4                7          3.021414

In [104]:
# Number of job candidates per state
sql_candidates = "SELECT state, COUNT(*) FROM sakila_dw2.dim_candidates GROUP BY state ORDER BY state;"
df_candidates = get_dataframe(user_id, pwd, host_name, src_dbname, sql_candidates)
df_candidates.head(10)

  state  COUNT(*)
0    AK         3
1    AZ         1
2    CA         5
3    FL         1
4    IL         2
5    KS         3
6    LA         2
7    MA         1
8    MD         2
9    MI         2